Tekla Open API Reference for Tekla Structures 2025
String Properties
The String type exposes the following members.
Properties
Name | Description
Value
 The value of the string datatype.
Top
See Also
Reference
String Structure
Tekla.Structures.Datatype Namespace